import React from 'react'
import './cookiesPolicies.css'
import { Navbar } from '../../components/navbar/Navbar'
import { useNavigate } from 'react-router-dom'
const CookiesPolicies = () => {
    const navigate=useNavigate()
  return (
     <div>
        <Navbar />
        <div class="containerCookies">
        <h1>سياسات استخدام ملفات تعريف الارتباط (الكوكيز) للتطبيق</h1>
        <p>نود أن نوضح سياساتنا المتعلقة باستخدام ملفات تعريف الارتباط (الكوكيز) في تطبيقنا. يعتبر استخدام ملفات تعريف الارتباط جزءًا أساسيًا من تجربة المستخدم، حيث يساعدنا على تقديم خدماتنا بشكل أفضل وتحسينها. يرجى قراءة هذه السياسات بعناية لفهم كيفية استخدامنا لملفات تعريف الارتباط وحماية خصوصيتك.</p>

        <h2>أغراض استخدام ملفات تعريف الارتباط:</h2>
        <ul>
        <li>تحسين تجربة المستخدم وتخصيصها وفقًا لاحتياجاتك الشخصية.</li>
        <li>توفير وتحسين الأمان والحماية على المنصة.</li>
        <li>تحليل استخدام التطبيق والاستجابة للمحتوى والميزات المختلفة.</li>
        </ul>

        <h2>أنواع ملفات تعريف الارتباط التي نستخدمها:</h2>
        <ul>
        <li>ملفات تعريف الارتباط الأساسية: تكون ضرورية للوصول إلى وظائف أساسية في التطبيق والتنقل بين الصفحات.</li>
        <li>ملفات تعريف الارتباط التحليلية: تساعدنا في فهم كيفية استخدام المستخدمين للتطبيق وتحسين أداء ووظائف التطبيق.</li>
        <li>ملفات تعريف الارتباط الاستهداف والإعلانية: يتم استخدامها لتقديم إعلانات مستهدفة وفقًا لاهتماماتك وتفضيلاتك.</li>
        </ul>

        <h2>مشاركة ملفات تعريف الارتباط:</h2>
        <ul>
        <li>لا نشارك معلومات ملفات تعريف الارتباط الخاصة بك مع أطراف ثالثة بدون موافقتك المسبقة، إلا إذا كان هذا مطلوبًا بموجب القانون.</li>
        <li>قد نشارك بيانات تحليلية مجمعة ومجهولة الهوية مع شركاءنا لتحسين خدماتنا وفهم أداء التطبيق.</li>
        </ul>
        <div class="button-container">
        <button class="button" onClick={()=>navigate('/')} >العودة إلى الصفحة الرئيسية</button>
    </div>
    </div>
  </div>
  )
}

export default CookiesPolicies